/*
 **********************************************************************
 *Copyright(c)		Lance Zhang
 *Identification	CHIC
 *Describtion		Template
 *
 *Present Version	1.0
 *Writer			Lance Zhang
 *Date				8/16/2018
 **********************************************************************
**中断服务函数文件
 **********************************************************************
 *中断服务函数不能放在.cpp文件中，因此需要额外建立一个.c文件
 **********************************************************************
**/
#include "Interrupt.h"
#include "delay.h"
/************************************************************************
 *输入捕获状态
 *[7]:	0:没有成功的捕获;
 *		1:成功捕获到一次.
 *
 *[6]:	0:还没捕获到低电平;
 *		1:已经捕获到低电平.
 *
 *[5:0]:捕获低电平后溢出的次数
************************************************************************/

//定时器3中断服务函数
void TIM3_IRQHandler(void)
{
	if(TIM_GetITStatus(TIM3,TIM_IT_Update)==SET) //溢出中断
	{
		PAout(5) =!PAout(5);//D3 翻转
		//中断159ms
		for(int i=0xffff;i>0;i--)
			for(int j=100;j>0;j--);
	}
	TIM_ClearITPendingBit(TIM3,TIM_IT_Update);  //清除中断标志位
}
